Show / Hide Table of Contents
Enum ImperfectionDirection
direction of imperfection
Namespace: IdeaRS.OpenModel.Concrete
Assembly: IdeaRS.OpenModel.dll
Syntax
public enum ImperfectionDirection
Fields
 Name |  Description
 BiggerSlenderner
bigger slenderness direction
 Both
both
 BothDirections
Imperfections are separately added to both directions, y and z.
 FromSetup
Takes imperfection direction from global code setup. This value must not be used in code setup!
 MomentResultant
resultant of moments
 Improve this Doc
 View Source